apache/nuttx/arch/arm/include/imxrt/imxrt117x_irq.h
#  define _IMXRT_GPIO2_16_31_NIRQS 16
#  define _IMXRT_GPIO3_0_15_BASE (_IMXRT_GPIO2_16_31_BASE + _IMXRT_GPIO2_16_31_NIRQS)
#  define IMXRT_GPIO2_NIRQS      (_IMXRT_GPIO2_0_15_NIRQS + _IMXRT_GPIO2_16_31_NIRQS)
#else
#  define _IMXRT_GPIO3_0_15_BASE _IMXRT_GPIO2_16_31_BASE
#  define IMXRT_GPIO2_NIRQS      _IMXRT_GPIO2_0_15_NIRQS
#endif

#ifdef CONFIG_IMXRT_GPIO3_0_15_IRQ
#  define IMXRT_IRQ_GPIO3_0      (_IMXRT_GPIO3_0_15_BASE + 0)   /* GPIO3 pin 0 interrupt */
#  define IMXRT_IRQ_GPIO3_1      (_IMXRT_GPIO3_0_15_BASE + 1)   /* GPIO3 pin 1 interrupt */
#  define IMXRT_IRQ_GPIO3_2      (_IMXRT_GPIO3_0_15_BASE + 2)   /* GPIO3 pin 2 interrupt */
#  define IMXRT_IRQ_GPIO3_3      (_IMXRT_GPIO3_0_15_BASE + 3)   /* GPIO3 pin 3 interrupt */
#  define IMXRT_IRQ_GPIO3_4      (_IMXRT_GPIO3_0_15_BASE + 4)   /* GPIO3 pin 4 interrupt */
#  define IMXRT_IRQ_GPIO3_5      (_IMXRT_GPIO3_0_15_BASE + 5)   /* GPIO3 pin 5 interrupt */
#  define IMXRT_IRQ_GPIO3_6      (_IMXRT_GPIO3_0_15_BASE + 6)   /* GPIO3 pin 6 interrupt */
#  define IMXRT_IRQ_GPIO3_7      (_IMXRT_GPIO3_0_15_BASE + 7)   /* GPIO3 pin 7 interrupt */
#  define IMXRT_IRQ_GPIO3_8      (_IMXRT_GPIO3_0_15_BASE + 8)   /* GPIO3 pin 8 interrupt */
#  define IMXRT_IRQ_GPIO3_9      (_IMXRT_GPIO3_0_15_BASE + 9)   /* GPIO3 pin 9 interrupt */
#  define IMXRT_IRQ_GPIO3_10     (_IMXRT_GPIO3_0_15_BASE + 10)  /* GPIO3 pin 10 interrupt */
#  define IMXRT_IRQ_GPIO3_11     (_IMXRT_GPIO3_0_15_BASE + 11)  /* GPIO3 pin 11 interrupt */
#  define IMXRT_IRQ_GPIO3_12     (_IMXRT_GPIO3_0_15_BASE + 12)  /* GPIO3 pin 12 interrupt */
#  define IMXRT_IRQ_GPIO3_13     (_IMXRT_GPIO3_0_15_BASE + 13)  /* GPIO3 pin 13 interrupt */
#  define IMXRT_IRQ_GPIO3_14     (_IMXRT_GPIO3_0_15_BASE + 14)  /* GPIO3 pin 14 interrupt */
#  define IMXRT_IRQ_GPIO3_15     (_IMXRT_GPIO3_0_15_BASE + 15)  /* GPIO3 pin 15 interrupt */

#  define _IMXRT_GPIO3_0_15_NIRQS 16
#  define _IMXRT_GPIO3_16_31_BASE (_IMXRT_GPIO3_0_15_BASE + _IMXRT_GPIO3_0_15_NIRQS)
#else
#  define _IMXRT_GPIO3_0_15_NIRQS 0
#  define _IMXRT_GPIO3_16_31_BASE _IMXRT_GPIO3_0_15_BASE
#endif

#ifdef CONFIG_IMXRT_GPIO3_16_31_IRQ
#  define IMXRT_IRQ_GPIO3_16     (_IMXRT_GPIO3_16_31_BASE + 0)   /* GPIO3 pin 16 interrupt */
#  define IMXRT_IRQ_GPIO3_17     (_IMXRT_GPIO3_16_31_BASE + 1)   /* GPIO3 pin 17 interrupt */
#  define IMXRT_IRQ_GPIO3_18     (_IMXRT_GPIO3_16_31_BASE + 2)   /* GPIO3 pin 18 interrupt */
#  define IMXRT_IRQ_GPIO3_19     (_IMXRT_GPIO3_16_31_BASE + 3)   /* GPIO3 pin 19 interrupt */
#  define IMXRT_IRQ_GPIO3_20     (_IMXRT_GPIO3_16_31_BASE + 4)   /* GPIO3 pin 20 interrupt */
#  define IMXRT_IRQ_GPIO3_21     (_IMXRT_GPIO3_16_31_BASE + 5)   /* GPIO3 pin 21 interrupt */
#  define IMXRT_IRQ_GPIO3_22     (_IMXRT_GPIO3_16_31_BASE + 6)   /* GPIO3 pin 22 interrupt */
#  define IMXRT_IRQ_GPIO3_23     (_IMXRT_GPIO3_16_31_BASE + 7)   /* GPIO3 pin 23 interrupt */
#  define IMXRT_IRQ_GPIO3_24     (_IMXRT_GPIO3_16_31_BASE + 8)   /* GPIO3 pin 24 interrupt */
#  define IMXRT_IRQ_GPIO3_25     (_IMXRT_GPIO3_16_31_BASE + 9)   /* GPIO3 pin 25 interrupt */
#  define IMXRT_IRQ_GPIO3_26     (_IMXRT_GPIO3_16_31_BASE + 10)  /* GPIO3 pin 26 interrupt */
#  define IMXRT_IRQ_GPIO3_27     (_IMXRT_GPIO3_16_31_BASE + 11)  /* GPIO3 pin 27 interrupt */
#  define IMXRT_IRQ_GPIO3_28     (_IMXRT_GPIO3_16_31_BASE + 12)  /* GPIO3 pin 28 interrupt */
#  define IMXRT_IRQ_GPIO3_29     (_IMXRT_GPIO3_16_31_BASE + 13)  /* GPIO3 pin 29 interrupt */
#  define IMXRT_IRQ_GPIO3_30     (_IMXRT_GPIO3_16_31_BASE + 14)  /* GPIO3 pin 30 interrupt */
#  define IMXRT_IRQ_GPIO3_31     (_IMXRT_GPIO3_16_31_BASE + 15)  /* GPIO3 pin 31 interrupt */

#  define _IMXRT_GPIO3_16_31_NIRQS 16
#  define _IMXRT_GPIO4_0_15_BASE (_IMXRT_GPIO3_16_31_BASE + _IMXRT_GPIO3_16_31_NIRQS)
#  define IMXRT_GPIO3_NIRQS      (_IMXRT_GPIO3_0_15_NIRQS + _IMXRT_GPIO3_16_31_NIRQS)
#else
#  define _IMXRT_GPIO4_0_15_BASE _IMXRT_GPIO3_16_31_BASE
#  define IMXRT_GPIO3_NIRQS      _IMXRT_GPIO3_0_15_NIRQS
#endif

#ifdef CONFIG_IMXRT_GPIO4_0_15_IRQ
#  define IMXRT_IRQ_GPIO4_0      (_IMXRT_GPIO4_0_15_BASE + 0)   /* GPIO4 pin 0 interrupt */
#  define IMXRT_IRQ_GPIO4_1      (_IMXRT_GPIO4_0_15_BASE + 1)   /* GPIO4 pin 1 interrupt */
#  define IMXRT_IRQ_GPIO4_2      (_IMXRT_GPIO4_0_15_BASE + 2)   /* GPIO4 pin 2 interrupt */
#  define IMXRT_IRQ_GPIO4_3      (_IMXRT_GPIO4_0_15_BASE + 3)   /* GPIO4 pin 3 interrupt */
#  define IMXRT_IRQ_GPIO4_4      (_IMXRT_GPIO4_0_15_BASE + 4)   /* GPIO4 pin 4 interrupt */
#  define IMXRT_IRQ_GPIO4_5      (_IMXRT_GPIO4_0_15_BASE + 5)   /* GPIO4 pin 5 interrupt */
#  define IMXRT_IRQ_GPIO4_6      (_IMXRT_GPIO4_0_15_BASE + 6)   /* GPIO4 pin 6 interrupt */
#  define IMXRT_IRQ_GPIO4_7      (_IMXRT_GPIO4_0_15_BASE + 7)   /* GPIO4 pin 7 interrupt */
#  define IMXRT_IRQ_GPIO4_8      (_IMXRT_GPIO4_0_15_BASE + 8)   /* GPIO4 pin 8 interrupt */
#  define IMXRT_IRQ_GPIO4_9      (_IMXRT_GPIO4_0_15_BASE + 9)   /* GPIO4 pin 9 interrupt */
#  define IMXRT_IRQ_GPIO4_10     (_IMXRT_GPIO4_0_15_BASE + 10)  /* GPIO4 pin 10 interrupt */
#  define IMXRT_IRQ_GPIO4_11     (_IMXRT_GPIO4_0_15_BASE + 11)  /* GPIO4 pin 11 interrupt */
#  define IMXRT_IRQ_GPIO4_12     (_IMXRT_GPIO4_0_15_BASE + 12)  /* GPIO4 pin 12 interrupt */
#  define IMXRT_IRQ_GPIO4_13     (_IMXRT_GPIO4_0_15_BASE + 13)  /* GPIO4 pin 13 interrupt */
#  define IMXRT_IRQ_GPIO4_14     (_IMXRT_GPIO4_0_15_BASE + 14)  /* GPIO4 pin 14 interrupt */
#  define IMXRT_IRQ_GPIO4_15     (_IMXRT_GPIO4_0_15_BASE + 15)  /* GPIO4 pin 15 interrupt */

#  define _IMXRT_GPIO4_0_15_NIRQS 16
#  define _IMXRT_GPIO4_16_31_BASE (_IMXRT_GPIO4_0_15_BASE + _IMXRT_GPIO4_0_15_NIRQS)
#else
#  define _IMXRT_GPIO4_0_15_NIRQS 0
#  define _IMXRT_GPIO4_16_31_BASE _IMXRT_GPIO4_0_15_BASE
#endif

#ifdef CONFIG_IMXRT_GPIO4_16_31_IRQ
#  define IMXRT_IRQ_GPIO4_16     (_IMXRT_GPIO4_16_31_BASE + 0)   /* GPIO4 pin 16 interrupt */
#  define IMXRT_IRQ_GPIO4_17     (_IMXRT_GPIO4_16_31_BASE + 1)   /* GPIO4 pin 17 interrupt */
#  define IMXRT_IRQ_GPIO4_18     (_IMXRT_GPIO4_16_31_BASE + 2)   /* GPIO4 pin 18 interrupt */
#  define IMXRT_IRQ_GPIO4_19     (_IMXRT_GPIO4_16_31_BASE + 3)   /* GPIO4 pin 19 interrupt */
#  define IMXRT_IRQ_GPIO4_20     (_IMXRT_GPIO4_16_31_BASE + 4)   /* GPIO4 pin 20 interrupt */
#  define IMXRT_IRQ_GPIO4_21     (_IMXRT_GPIO4_16_31_BASE + 5)   /* GPIO4 pin 21 interrupt */
#  define IMXRT_IRQ_GPIO4_22     (_IMXRT_GPIO4_16_31_BASE + 6)   /* GPIO4 pin 22 interrupt */
#  define IMXRT_IRQ_GPIO4_23     (_IMXRT_GPIO4_16_31_BASE + 7)   /* GPIO4 pin 23 interrupt */
#  define IMXRT_IRQ_GPIO4_24     (_IMXRT_GPIO4_16_31_BASE + 8)   /* GPIO4 pin 24 interrupt */
#  define IMXRT_IRQ_GPIO4_25     (_IMXRT_GPIO4_16_31_BASE + 9)   /* GPIO4 pin 25 interrupt */
#  define IMXRT_IRQ_GPIO4_26     (_IMXRT_GPIO4_16_31_BASE + 10)  /* GPIO4 pin 26 interrupt */
#  define IMXRT_IRQ_GPIO4_27     (_IMXRT_GPIO4_16_31_BASE + 11)  /* GPIO4 pin 27 interrupt */
#  define IMXRT_IRQ_GPIO4_28     (_IMXRT_GPIO4_16_31_BASE + 12)  /* GPIO4 pin 28 interrupt */
#  define IMXRT_IRQ_GPIO4_29     (_IMXRT_GPIO4_16_31_BASE + 13)  /* GPIO4 pin 29 interrupt */
#  define IMXRT_IRQ_GPIO4_30     (_IMXRT_GPIO4_16_31_BASE + 14)  /* GPIO4 pin 30 interrupt */
#  define IMXRT_IRQ_GPIO4_31     (_IMXRT_GPIO4_16_31_BASE + 15)  /* GPIO4 pin 31 interrupt */

