apache/nuttx/arch/arm/include/imxrt/imxrt117x_irq.h
#if defined(CONFIG_IMXRT_GPIO7_0_15_IRQ) || defined(CONFIG_IMXRT_GPIO7_16_31_IRQ)
#  warning GPIO7 has no IRQ support on i.MX RT117X
#endif

#if defined(CONFIG_IMXRT_GPIO8_0_15_IRQ) || defined(CONFIG_IMXRT_GPIO8_16_31_IRQ)
#  warning GPIO8 has no IRQ support on i.MX RT117X
#endif

#if defined(CONFIG_IMXRT_GPIO9_0_15_IRQ) || defined(CONFIG_IMXRT_GPIO9_16_31_IRQ)
#  warning GPIO9 has no IRQ support on i.MX RT117X
#endif

#ifdef CONFIG_IMXRT_GPIO13_IRQ
#  define IMXRT_IRQ_GPIO13_0     (_IMXRT_GPIO13_BASE + 0)   /* GPIO13 pin 0 interrupt */
#  define IMXRT_IRQ_GPIO13_1     (_IMXRT_GPIO13_BASE + 1)   /* GPIO13 pin 1 interrupt */
#  define IMXRT_IRQ_GPIO13_2     (_IMXRT_GPIO13_BASE + 2)   /* GPIO13 pin 2 interrupt */
#  define IMXRT_IRQ_GPIO13_3     (_IMXRT_GPIO13_BASE + 3)   /* GPIO13 pin 3 interrupt */
#  define IMXRT_IRQ_GPIO13_4     (_IMXRT_GPIO13_BASE + 4)   /* GPIO13 pin 4 interrupt */
#  define IMXRT_IRQ_GPIO13_5     (_IMXRT_GPIO13_BASE + 5)   /* GPIO13 pin 5 interrupt */
#  define IMXRT_IRQ_GPIO13_6     (_IMXRT_GPIO13_BASE + 6)   /* GPIO13 pin 6 interrupt */
#  define IMXRT_IRQ_GPIO13_7     (_IMXRT_GPIO13_BASE + 7)   /* GPIO13 pin 7 interrupt */
#  define IMXRT_IRQ_GPIO13_8     (_IMXRT_GPIO13_BASE + 8)   /* GPIO13 pin 8 interrupt */
#  define IMXRT_IRQ_GPIO13_9     (_IMXRT_GPIO13_BASE + 9)   /* GPIO13 pin 9 interrupt */
#  define IMXRT_IRQ_GPIO13_10    (_IMXRT_GPIO13_BASE + 10)  /* GPIO13 pin 10 interrupt */
#  define IMXRT_IRQ_GPIO13_11    (_IMXRT_GPIO13_BASE + 11)  /* GPIO13 pin 11 interrupt */
#  define IMXRT_IRQ_GPIO13_12    (_IMXRT_GPIO13_BASE + 12)  /* GPIO13 pin 12 interrupt */
#  define IMXRT_IRQ_GPIO13_13    (_IMXRT_GPIO13_BASE + 13)  /* GPIO13 pin 13 interrupt */
#  define IMXRT_IRQ_GPIO13_14    (_IMXRT_GPIO13_BASE + 14)  /* GPIO13 pin 14 interrupt */
#  define IMXRT_IRQ_GPIO13_15    (_IMXRT_GPIO13_BASE + 15)  /* GPIO13 pin 15 interrupt */
#  define IMXRT_IRQ_GPIO13_16    (_IMXRT_GPIO13_BASE + 16)  /* GPIO13 pin 16 interrupt */
#  define IMXRT_IRQ_GPIO13_17    (_IMXRT_GPIO13_BASE + 17)  /* GPIO13 pin 17 interrupt */
#  define IMXRT_IRQ_GPIO13_18    (_IMXRT_GPIO13_BASE + 18)  /* GPIO13 pin 18 interrupt */
#  define IMXRT_IRQ_GPIO13_19    (_IMXRT_GPIO13_BASE + 19)  /* GPIO13 pin 19 interrupt */
#  define IMXRT_IRQ_GPIO13_20    (_IMXRT_GPIO13_BASE + 20)  /* GPIO13 pin 20 interrupt */
#  define IMXRT_IRQ_GPIO13_21    (_IMXRT_GPIO13_BASE + 21)  /* GPIO13 pin 21 interrupt */
#  define IMXRT_IRQ_GPIO13_22    (_IMXRT_GPIO13_BASE + 22)  /* GPIO13 pin 22 interrupt */
#  define IMXRT_IRQ_GPIO13_23    (_IMXRT_GPIO13_BASE + 23)  /* GPIO13 pin 23 interrupt */
#  define IMXRT_IRQ_GPIO13_24    (_IMXRT_GPIO13_BASE + 24)  /* GPIO13 pin 24 interrupt */
#  define IMXRT_IRQ_GPIO13_25    (_IMXRT_GPIO13_BASE + 25)  /* GPIO13 pin 25 interrupt */
#  define IMXRT_IRQ_GPIO13_26    (_IMXRT_GPIO13_BASE + 26)  /* GPIO13 pin 26 interrupt */
#  define IMXRT_IRQ_GPIO13_27    (_IMXRT_GPIO13_BASE + 27)  /* GPIO13 pin 27 interrupt */
#  define IMXRT_IRQ_GPIO13_28    (_IMXRT_GPIO13_BASE + 28)  /* GPIO13 pin 28 interrupt */
#  define IMXRT_IRQ_GPIO13_29    (_IMXRT_GPIO13_BASE + 29)  /* GPIO13 pin 29 interrupt */
#  define IMXRT_IRQ_GPIO13_30    (_IMXRT_GPIO13_BASE + 30)  /* GPIO13 pin 30 interrupt */
#  define IMXRT_IRQ_GPIO13_31    (_IMXRT_GPIO13_BASE + 31)  /* GPIO13 pin 31 interrupt */

#  define IMXRT_GPIO13_NIRQS     32
#else
#  define IMXRT_GPIO13_NIRQS     0
#endif

#define IMXRT_GPIO_NIRQS         (IMXRT_GPIO1_NIRQS + IMXRT_GPIO2_NIRQS + \
                                  IMXRT_GPIO3_NIRQS + IMXRT_GPIO4_NIRQS + \
                                  IMXRT_GPIO5_NIRQS + IMXRT_GPIO6_NIRQS + \
                                  IMXRT_GPIO13_NIRQS)
#define IMXRT_GPIO_IRQ_LAST      (_IMXRT_GPIO1_0_15_BASE + IMXRT_GPIO_NIRQS)

/* Total number of IRQ numbers **********************************************/

#define NR_IRQS                  (IMXRT_IRQ_EXTINT + IMXRT_IRQ_NEXTINT + IMXRT_GPIO_NIRQS)

/****************************************************************************
 * Public Types
 ****************************************************************************/

/****************************************************************************
 * Inline functions
 ****************************************************************************/

/****************************************************************************
 * Public Data
 ****************************************************************************/

/****************************************************************************
 * Public Function Prototypes
 ****************************************************************************/

#ifndef __ASSEMBLY__
#ifdef __cplusplus
#define EXTERN extern "C"
extern "C"
{
#else
#define EXTERN extern
#endif

#undef EXTERN
#ifdef __cplusplus
}
#endif
#endif

#endif /* __ARCH_ARM_INCLUDE_IMXRT_IMXRT117X_IRQ_H */
